# Система прогнозирования продажи отелей

## Описание
Строится модель прогнозирования отказа от брони клиента. В качестве метрики предлагается использовать величину выручки, которая получится после внедрения модели машинного обучения.

## Цели
1. Обучить модели для определения вероятности ухода клиента от сети отелей.
2. Предобработать данные для повышения точности моделей.
3. Оценить экономическую выгоду от использования каждой модели.
4. Оптимизировать модели для максимальной прибыли.
5. Анализировать характеристики ненадежных клиентов для разработки стратегий удержания.

## Вывод
Обучили три модели и оптимизировали гиперпараметры через байесовскую оптимизацию, выбрав полноту как ключевую метрику для оценки. Модели показали схожие результаты, но лучшей по метрикам стала логистическая регрессия. Впрочем, наибольшую прибыль обеспечила модель решающего дерева, несмотря на худшие показатели метрик. Реализация модели принесла чистую прибыль в несколько миллионов.

## Сферы деятельности
- Туризм
- Интернет-сервисы

## Направление деятельности
- Машинное обучение
- Разработка бизнес-модели

## Задачи проекта
- Прогнозировать кто из клиентов откажется от брони

## Ключевые слова для поиска
- Классификация
- Бизнес модель

## Навыки и инструменты
- `Python`
- `Pandas`
- `Matplotlib`
- `NumPy`
- `Scikit-learn`
```
